<?php
/**
 * +-------------------------------------------
 * |
 * +-------------------------------------------
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2020/11/4
 * Time: 20:12
 * +-------------------------------------------
 */


return [

    '10000' => '{:name}成功',
    '10001' => '已经被注册',
    '20001' => '{:name}失败',
    '20002' => 'code编码不存在',
    '20003' => '参数为空',
    '20004' => '登录账号/密码错误',
    '20005' => 'token验证失败',
    '20006' => '数据为空',
    '20008' => '超过字符长度',
    '20009' => '剩余课时已为0，不可修改！',
    '20010' => '已有此数据',
    '20011' => '必须 {:format}数字',
    '20012' => '请十分钟后再点击',
    '20013' => '必须是字符',
    '20014' => '网站异常，请联系管理员',
    '30001' => '方法不存在'

];
